# Лабораторна робота №1. Основи Python
# Варіант: 3.Напишіть програму для обчислення індексу маси тіла (ІМТ) за формулою ІМТ = вага (кг) / (зріст (м))^2. Користувач вводить вагу та зріст
# ПІБ: Бігун Іван Олександрович

# 1. Введення даних з перевіркою на коректність
while True:
    try:
        weight = float(input("Введіть вашу вагу (в кілограмах): "))
        height = float(input("Введіть ваш зріст (у метрах, наприклад 1.87): "))
        
        # Перевірка: вага та зріст не можуть бути меншими або дорівнювати нулю
        if weight <= 0 or height <= 0:
            raise ValueError("Вага та зріст повинні бути додатними числами.")
            
        break # Якщо все введено правильно, виходимо з нескінченного циклу
    except ValueError as e:
        # Сповіщаємо користувача про помилку і цикл починається заново
        print(f"Помилка: {e} Будь ласка, спробуйте ще раз.\n")

# 2. Реалізація обчислень
# Обчислення Індексу Маси Тіла (ІМТ) за заданою формулою
bmi = weight / (height ** 2)

# 3. Реалізація виведення результатів
print("\nРезультати обчислень:")
print(f"Ваш Індекс Маси Тіла (ІМТ): {bmi:.2f}")

# 4. Реалізація додаткової функціональності (аналіз результату)
if bmi < 18.5:
    print("Категорія: Недостатня маса тіла.")
elif 18.5 <= bmi < 24.9:
    print("Категорія: Нормальна маса тіла.")
elif 25 <= bmi < 29.9:
    print("Категорія: Надмірна маса тіла.")
else:
    print("Категорія: Ожиріння.")
